In [1]:
import pandas as pd
import numpy as np

In [2]:
stocks = pd.read_csv("http://bit.ly/smallstocks")

In [3]:
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [4]:
stocks.index

RangeIndex(start=0, stop=9, step=1)

In [5]:
stocks.groupby('Symbol').Close.mean()    # what this is doing is that grouping all the close 
# value according to their given symbol

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [6]:
ser = stocks.groupby(['Symbol','Date']).Close.mean()  
ser # this is a series with a multi index 
# this says that for each pair of symbol and date 
# what is the mean price of the stocks 
# in this case it is unnecessary as there is only one closing price 
# but if we have if we have price which has starting and closing price for a day then it is good 
#to have the mean of that data

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [7]:
# Ex like a series is a 1 dimensional but a series with a two indexes is 2 dimensional 
# similarly a dataframe is a two dimensinal but a dataframe with 2 indexes is a is atleast 3 dimensional

In [8]:
ser.index # it says the following series has two indexes

MultiIndex([('AAPL', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('AAPL', '2016-10-05'),
            ('CSCO', '2016-10-03'),
            ('CSCO', '2016-10-04'),
            ('CSCO', '2016-10-05'),
            ('MSFT', '2016-10-03'),
            ('MSFT', '2016-10-04'),
            ('MSFT', '2016-10-05')],
           names=['Symbol', 'Date'])

In [9]:
# now we can unpack or unstack a multi index series which will become a dataframe for two indexes
# as a two dimension series is a dataframe
ser.unstack()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [10]:
# this can also be done by this
df = stocks.pivot_table(values = 'Close',index = "Symbol",columns = "Date" )
df
# default aggregation function is mean for a pivot_table meaning it will take the mean 
# of openig and closing prices of price if there in the dataset

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [11]:
# the selection we use loc 
ser.loc["AAPL"] # for a particular Symbol

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

In [12]:
# for a particular symbol and date
ser.loc["AAPL","2016-10-03"]

112.52

In [13]:
# if we want to select according to the date 
ser.loc[:,"2016-10-03"]

Symbol
AAPL    112.52
CSCO     31.50
MSFT     57.42
Name: Close, dtype: float64

In [14]:
# when we have a dataframe df mentionoed above we can also select exactly the same way we are selecting 
# for the ser

In [15]:
# noe for the stocks dataframe
stocks.set_index(['Symbol',"Date"],inplace = True)

In [16]:
stocks

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

In [17]:
stocks.sort_index(inplace = True)

In [18]:
stocks

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [19]:
# how do we select from this 
stocks.loc['AAPL']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800
2016-10-05  113.05  21453100

In [21]:
stocks.loc["AAPL","2016-10-03"] # teh very first thing come in mind is this but this is not 
# a good practice

Close          112.52
Volume    21701800.00
Name: (AAPL, 2016-10-03), dtype: float64

In [22]:
# we should select it in this way
stocks.loc[("AAPL","2016-10-03"),:] # just pas it in the form of tuple inorder not to confuse the pandas 
# as we are putting the date in form of index or in a row

Close          112.52
Volume    21701800.00
Name: (AAPL, 2016-10-03), dtype: float64

In [23]:
stocks.loc[("AAPL","2016-10-03"),"Close"]

112.52

In [26]:
stocks.loc[(["AAPL",'MSFT'],"2016-10-03"),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500

In [28]:
stocks.loc[("AAPL",["2016-10-03",'2016-10-04','2016-10-05']),:]
# if u want to see the data according to dates

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100

In [29]:
stocks.loc[(slice(None),["2016-10-03",'2016-10-04','2016-10-05']),:]  
# if we want for all the symbol also we use slice none

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [30]:
# to reset the indexes 
stocks.reset_index()

  Symbol        Date   Close    Volume
0   AAPL  2016-10-03  112.52  21701800
1   AAPL  2016-10-04  113.00  29736800
2   AAPL  2016-10-05  113.05  21453100
3   CSCO  2016-10-03   31.50  14070500
4   CSCO  2016-10-04   31.35  18460400
5   CSCO  2016-10-05   31.59  11808600
6   MSFT  2016-10-03   57.42  19189500
7   MSFT  2016-10-04   57.24  20085900
8   MSFT  2016-10-05   57.64  16726400